#+title: Sprint Backlog 03
#+options: date:nil toc:nil author:nil num:nil
#+todo: STARTED | COMPLETED CANCELLED POSTPONED
#+tags: { story(s) spike(p) }

* Mission

- Add basic SWC support.
- Create a mesh wit CGAL

* Stories

** Active

#+begin: clocktable :maxlevel 3 :scope subtree :indent nil :emphasize nil :scope file :narrow 75
#+CAPTION: Clock summary at [2015-12-04 Fri 14:00]
| <75>                                                                        |         |       |       |
| Headline                                                                    | Time    |       |       |
|-----------------------------------------------------------------------------+---------+-------+-------|
| *Total time*                                                                | *49:02* |       |       |
|-----------------------------------------------------------------------------+---------+-------+-------|
| Stories                                                                     | 49:02   |       |       |
| Active                                                                      |         | 49:02 |       |
| COMPLETED Sprint and product backlog grooming                               |         |       |  0:06 |
| COMPLETED Journal club and other activities                                 |         |       |  2:23 |
| COMPLETED Create a blog post discussing NEURON file formats                 |         |       |  3:20 |
| COMPLETED Create a post on microscopy                                       |         |       |  9:46 |
| COMPLETED Create a progress report                                          |         |       | 18:36 |
| COMPLETED Fill in paperwork                                                 |         |       |  8:31 |
| COMPLETED Create a ball and stick neuron using NEURON                       |         |       |  6:20 |
#+end:

*** COMPLETED Sprint and product backlog grooming                     :story:
    CLOSED: [2015-12-04 Fri 13:59]
    CLOCK: [2015-11-17 Tue 14:44]--[2015-11-17 Tue 14:47] =>  0:03
    CLOCK: [2015-11-10 Tue 17:58]--[2015-11-10 Tue 18:01] =>  0:03

Updates to sprint and product backlog.

*** COMPLETED Journal club and other activities                       :story:
    CLOSED: [2015-12-04 Fri 13:59]
    CLOCK: [2015-11-20 Fri 15:42]--[2015-11-20 Fri 18:05] =>  2:23

Time spent in generic tasks.

*** COMPLETED Create a blog post discussing NEURON file formats       :story:
    CLOSED: [2015-11-11 Wed 18:01]
    CLOCK: [2015-11-11 Wed 14:41]--[2015-11-11 Wed 18:01] =>  3:20

We need a simple post talking about all the file formats we know
of. Actually for this sprint we need to narrow it down to just a
couple.
*** COMPLETED Create a post on microscopy                             :story:
    CLOSED: [2015-12-04 Fri 13:59]
    CLOCK: [2015-11-25 Wed 15:21]--[2015-11-25 Wed 18:02] =>  2:41
    CLOCK: [2015-11-24 Tue 17:07]--[2015-11-24 Tue 17:45] =>  0:38
    CLOCK: [2015-11-24 Tue 13:44]--[2015-11-24 Tue 17:07] =>  3:23
    CLOCK: [2015-11-17 Tue 14:48]--[2015-11-17 Tue 17:52] =>  3:04

Cover the basics on EM, OM etc.

*** COMPLETED Create a progress report                                :story:
    CLOSED: [2015-11-16 Mon 14:32]
    CLOCK: [2015-11-17 Tue 13:10]--[2015-11-17 Tue 14:43] =>  1:33
    CLOCK: [2015-11-15 Sun 18:47]--[2015-11-15 Sun 22:30] =>  3:43
    CLOCK: [2015-11-15 Sun 10:55]--[2015-11-15 Sun 14:34] =>  3:39
    CLOCK: [2015-11-14 Sat 15:53]--[2015-11-14 Sat 17:50] =>  1:57
    CLOCK: [2015-11-13 Fri 09:59]--[2015-11-13 Fri 14:40] =>  4:41
    CLOCK: [2015-11-12 Thu 20:55]--[2015-11-12 Thu 21:50] =>  0:55
    CLOCK: [2015-11-12 Thu 06:51]--[2015-11-12 Sun 07:44] =>  0:53
    CLOCK: [2015-11-11 Wed 22:55]--[2015-11-12 Thu 00:10] =>  1:15

Do a report describing the activities thus far.

*** COMPLETED Fill in paperwork                                       :story:
    CLOSED: [2015-12-04 Fri 14:00]
    CLOCK: [2015-11-25 Wed 14:35]--[2015-11-25 Wed 15:20] =>  0:45
    CLOCK: [2015-11-24 Tue 13:01]--[2015-11-24 Tue 17:07] =>  4:06
    CLOCK: [2015-11-23 Mon 14:30]--[2015-11-23 Mon 18:10] =>  3:40

Time spent sorting out forms, etc.

*** COMPLETED Create a ball and stick neuron using NEURON             :story:
    CLOSED: [2015-12-04 Fri 14:00]
    CLOCK: [2015-11-20 Fri 14:01]--[2015-11-20 Fri 15:41] =>  1:40
    CLOCK: [2015-11-18 Wed 15:31]--[2015-11-18 Wed 18:10] =>  2:39
    CLOCK: [2015-11-16 Mon 17:44]--[2015-11-16 Mon 17:57] =>  0:13
    CLOCK: [2015-11-16 Mon 15:55]--[2015-11-16 Mon 17:43] =>  1:48

We need to create a trivial neuron in NEURON and export it to SWC. We
should just follow the [[https://www.neuron.yale.edu/neuron/static/docs/cbtut/stylized/outline.html][CellBuilder tutorial]].

Neuron does not support SWC exports, at least according to this old
post: [[http://www.neuron.yale.edu/phpbb/viewtopic.php?f%3D13&t%3D787][converting hoc to swc]].

However we could try to get [[http://neuronland.org/NLMorphologyConverter/NLMorphologyConverter.html][NLMorphologyConverter]] to work over wine.
